<?php


namespace App\classes;


class Content
{

    public $contents = [], $data = [];

    public function __construct()
    {
        $this->contents = [
            0 => [
                'id' => 1,
                'menu_id' => 3,
                'title' => 'ঢাকা-১৭ আসনে আ.লীগের ফরম বিক্রি শুরু শনিবার',
                'description 1' => 'ঢাকা-১৭ আসনের উপনির্বাচনে আওয়ামী লীগের মনোনয়ন ফরম বিক্রি শুরু হবে ৩ জুন (শনিবার), চলবে ৬ জুন (মঙ্গলবার) পর্যন্ত। একই সঙ্গে ৯টি পৌরসভা নির্বাচনে মেয়র এবং ৩৭টি ইউনিয়ন পরিষদে চেয়ারম্যান পদেও দলীয় মনোনয়ন ফরম বিক্রি করা হবে।',
                'description 2' => 'ঢাকা-১৭ আসনের উপনির্বাচনে আওয়ামী লীগের মনোনয়ন ফরম বিক্রি শুরু হবে ৩ জুন (শনিবার), চলবে ৬ জুন (মঙ্গলবার) পর্যন্ত। একই সঙ্গে ৯টি পৌরসভা নির্বাচনে মেয়র এবং ৩৭টি ইউনিয়ন পরিষদে চেয়ারম্যান পদেও দলীয় মনোনয়ন ফরম বিক্রি করা হবে। গতকাল বৃহস্পতিবার আওয়ামী লীগের পক্ষ থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এ তথ্য জানানো হয়। বিজ্ঞপ্তিতে বলা হয়, শনিবার থেকে মঙ্গলবার পর্যন্ত প্রতিদিন সকাল সাড়ে ১০টা থেকে বিকেল সাড়ে ৪টা পর্যন্ত আওয়ামী লীগের মনোনয়ন ফরম সংগ্রহ ও জমা দেওয়া যাবে। দলীয় সভাপতি শেখ হাসিনার ধানমন্ডির রাজনৈতিক কার্যালয়ে চলবে এই কার্যক্রম।
                সংবাদ বিজ্ঞপ্তিতে আরও বলা হয়, সংশ্লিষ্ট নির্বাচনে আওয়ামী লীগের মনোনয়নপ্রত্যাশীদের যথাযথ স্বাস্থ্য সুরক্ষাবিধি মেনে এবং কোনো প্রকার অতিরিক্ত লোকসমাগম ছাড়া প্রার্থী নিজে অথবা প্রার্থীর একজন যোগ্য প্রতিনিধির মাধ্যমে ফরম সংগ্রহ ও জমা দিতে হবে। এ ছাড়া মনোনয়ন ফরম সংগ্রহের সময় অবশ্যই প্রার্থীর জাতীয় পরিচয়পত্রের ফটোকপি সঙ্গে আনতে হবে এবং ৬ জুন মঙ্গলবার বিকেল সাড়ে চারটার মধ্যে ফরম জমা দিতে হবে।',
                'image' => 'assets/img/contents/1.jpg',
            ],
            1 => [
                'id' => 2,
                'menu_id' => 3,
                'title' => 'এবারের বাজেট নিম্নবিত্ত ও নিম্নমধ্যবিত্তদের মৃত্যুমুখে ঠেলে দেবে: এবি পার্টি',
                'description 1' => 'দ্রব্যমূল্যের ঊর্ধ্বগতি, বিদ্যুৎ ও জ্বালানিসংকট এবং প্রহসনের বাজেটের প্রতিবাদে বিক্ষোভ মিছিল ও সমাবেশ করে এবি পার্টিছবি: সংগৃহীত',
                'description 2' => 'আগামী অর্থবছরের (২০২৩-২৪) বাজেট নিম্নবিত্ত ও নিম্নমধ্যবিত্তদের ধীরে ধীরে মৃত্যুমুখে ঠেলে দেবে। সরকার বাজেট করেছে নিজেদের ও তাদের সিন্ডিকেটের উচ্চবিত্ত সদস্যদের স্বার্থ রক্ষায়। আজ শুক্রবার বিকেলে আমার বাংলাদেশ পার্টির (এবি পার্টি) কেন্দ্রীয় কার্যালয় চত্বরে অনুষ্ঠিত এক সমাবেশে নেতারা এসব কথা বলেন। দ্রব্যমূল্যের ঊর্ধ্বগতি, বিদ্যুৎ ও জ্বালানিসংকট এবং প্রহসনের বাজেটের প্রতিবাদে এ মিছিল ও সমাবেশের আয়োজন করা হয়। সমাবেশের প্রধান বক্তা দলের সদস্যসচিব মজিবুর রহমান বলেন, দেশের মানুষের প্রয়োজন ও প্রত্যাশা সামনে রেখে বাজেট তৈরি করা হয়। কিন্তু সরকার বাজেট করেছে নিজেদের ও তাদের সিন্ডিকেটের উচ্চবিত্ত সদস্যদের স্বার্থ রক্ষায়। মজিবুর রহমান বলেন, প্রচণ্ড গরমে মানুষ ঘুমাতে পারছে না। দুর্নীতিবাজ সরকারের লোডশেডিংয়ের যন্ত্রণায় মানুষের জীবন দুর্বিষহ। বিদ্যুৎ ও জ্বালানিসংকটে নিত্যপ্রয়োজনীয় সবকিছুর দাম বেশি। এখন বেশির ভাগ মানুষের সবচেয়ে বড় প্রয়োজন খেয়েপরে কোনোরকমে বেঁচে থাকা। কিন্তু সরকার এমন বাজেট করেছে, যাতে নিম্নবিত্ত ও নিম্নমধ্যবিত্ত শ্রেণি ধুঁকে ধুঁকে মৃত্যুমুখে পতিত হয়। এই বাজেটের মাধ্যমে জনগণের মৃত্যুর পরোয়ানা জারি হয়েছে দাবি করে মজিবুর রহমান বলেন, সরকার যে কর বৃদ্ধি করেছে, তা জনগণকে ঋণগ্রস্ত করবে। বাজেটে দরিদ্র মানুষের জন্য কিছু নেই। এই অবাস্তব বাজেটের বিরুদ্ধে অবস্থান নিতে হবে। এবারের বাজেট বরাবরের মতোই গতানুগতিক, উচ্চাভিলাষী ও লুটপাটের ধারা অব্যাহত রাখার বলে মন্তব্য করেন তিনি। সভাপতির বক্তব্যে আইনজীবী তাজুল ইসলাম বলেন, আন্তর্জাতিক বাজারে জ্বালানি তেলের দাম কমলেও বাংলাদেশে জ্বালানির দাম না কমানো জনগণের অধিকার হরণ ও তাদের প্রতি চরম নিষ্পেষণ। এই বাজেটে চলমান দ্রব্যের মূল্যবৃদ্ধি আরও দীর্ঘায়িত হবে। বিদ্যুৎ–সংকট চরম পর্যায়ে যাবে। তাজুল বলেন, ‘নাগরিক হিসেবে বাজেট থেকে আমরা সচ্ছলতা ও সম্মান চাই। সরকার করছে উল্টোটা, যাদের আয় নেই, কর দেওয়ার সামর্থ্য নেই, কিন্তু আয়কর পরিচিতি নম্বর আছে, সরকার তাঁদের দুই হাজার টাকা কর দিতে বাধ্য করছে। দলের জ্যেষ্ঠ সহকারী সদস্যসচিব আনোয়ার সাদাতের সঞ্চালনায় সমাবেশে বক্তব্য দেন দলের যুগ্ম সদস্যসচিব আসাদুজ্জামান ফুয়াদ, এবি যুব পার্টির আহ্বায়ক এ বি এম খালিদ হাসান, সহকারী সদস্যসচিব এম আমজাদ খান, মোহাম্মদ লোকমান, মহানগর উত্তরের আহ্বায়ক আলতাফ হুসেইন, মহানগর দক্ষিণের যুগ্ম আহ্বায়ক আনোয়ার ফারুক প্রমুখ। সমাবেশ শেষে একটি বিক্ষোভ মিছিল করা হয়।',
                'image' => 'assets/img/contents/2.jpg',
            ],
            2 => [
                'id' => 3,
                'menu_id' => 3,
                'title' => 'নেতা-কর্মীদের উদ্দেশে মির্জা আব্বাস / পুলিশ ঝামেলা করলে ভিডিও রাখবেন, ছবি রাখবেন',
                'description 1' => 'সামনে আওয়ামী লীগের হয় পতন, না হয় পলায়ন অপেক্ষা করছে। এই মন্তব্য বিএনপির স্থায়ী কমিটির সদস্য মির্জা আব্বাসের।',
                'description 2' => 'পুলিশ বা সরকারি কোনো সংস্থা ঝামেলা করলে তার ‘ভিডিও’ এবং ‘ছবি’ নিয়ে রাখতে নেতা-কর্মীদের নির্দেশনা দিয়েছেন বিএনপির স্থায়ী কমিটির সদস্য মির্জা আব্বাস। আজ শুক্রবার দুপুরে ঢাকার নয়াপল্টনে দলের প্রতিষ্ঠাতা জিয়াউর রহমানের মৃত্যুবার্ষিকী উপলক্ষে এক দোয়া মাহফিল ও তবারক বিতরণ অনুষ্ঠানে তিনি এ নির্দেশনা দেন। মির্জা আব্বাস বলেন, ‘সামনে আওয়ামী লীগের হয় পতন, না হয় পলায়ন অপেক্ষা করছে। আমরা তাদের পতনে সাহায্য করব, কিন্তু পলায়নে সাহায্য করব না। দীর্ঘদিন ধরে নেতা-কর্মীদের গ্রেপ্তার ও হয়রানির ঘটনার উল্লেখ করে মির্জা আব্বাস বলেন, ‘পুলিশ ভাইয়েরা, আপনারা আমাদের গ্রেপ্তার করেন, ধরে নিয়ে যান, কষ্ট দেন। এতে বিএনপির নেতা-কর্মীদের মনে অনেক ক্ষোভ থাকতে পারে। সে ক্ষোভ নিরসনের লক্ষ্যে বলব, সব পুলিশ কিন্তু এক রকম না। কিছু পুলিশ ভালো আছে, কিছু পুলিশ খারাপ আছে। যে লোকগুলো, যে প্রতিষ্ঠান আপনাকে ঝামেলা করবে, কষ্ট করে হলেও একটা ভিডিও করে রাখবেন, আর একটা ছবি রাখবেন। যেখানে হোক, কারণ এদের কাউকে ছাড়া যাবে না। বিএনপির এই নেতা বলেন, খালেদা জিয়া তিনবার ক্ষমতায় এসেছেন, প্রধানমন্ত্রী হয়েছেন। কখনোই তিনি ভোট চুরি করে ক্ষমতায় আসেননি। কিন্তু আওয়ামী লীগ ভোট চুরি করে ১৪টি বছর ধরে ক্ষমতা আঁকড়ে রেখেছে। এই অনির্বাচিত সরকার শুধু গণতন্ত্রকেই হত্যা করেনি, লুটপাট করে দেশকে ফোকলা বানিয়ে ফেলেছে। হাজার হাজার কোটি টাকা পাচার করে বেগম পাড়া বানিয়েছে। সরকার ভালোভাবেই জানে জনগণের ভোটে তারা কখনো ক্ষমতায় আসতে পারবে না। সভাপতির বক্তব্যে ঢাকা মহানগর দক্ষিণ বিএনপির আহ্বায়ক আবদুস সালাম বলেন, ‘দেশের গণতন্ত্র, জনগণের ভোট এবং ভাতের অধিকার ফিরিয়ে আনতেই আমদের এ আন্দোলন। ঐক্যবদ্ধ গণ-আন্দোলনের মাধ্যমেই সরকারের পতন নিশ্চিত করতে হবে। এ জন্য সবাইকে প্রস্তুতি নিতে হবে।’ ঢাকা মহানগর দক্ষিণ বিএনপি আয়োজিত এই দোয়া মাহফিল ও তবারক বিতরণ অনুষ্ঠানে কয়েক হাজার নেতা-কর্মী অংশ নেন। কর্মসূচিতে অংশ নিয়ে আরও বক্তব্য দেন বিএনপির ভাইস চেয়ারম্যান বরকতউল্লা, জ্যেষ্ঠ যুগ্ম মহাসচিব রুহুল কবির রিজভী, যুবদলের সভাপতি সুলতান সালাউদ্দিন, ছাত্রদলের সভাপতি কাজী রওনাকুল ইসলাম, সাধারণ সম্পাদক সাইফ মাহমুদ জুয়েল, মহানগর দক্ষিণ বিএনপির সিনিয়র যুগ্ম আহ্বায়ক নবী উল্লাহ, ইউনুস মৃধা, মোশাররফ হোসেন, আ ন ম সাইফুল ইসলাম, তানভীর আহমেদ প্রমুখ।',
                'image' => 'assets/img/contents/3.jpg',
            ],
            3 => [
                'id' => 4,
                'menu_id' => 1,
                'title' => 'চ্যাটজিপিটি এবং বন্ধু সরদারের জন্মদিন',
                'description 1' => 'সকালবেলা পত্রিকা হাতে নিতেই একটা খবরে চোখ আটকে গেল। ডেনমার্কের প্রধানমন্ত্রী মিতে ফ্রেডিরিকসেন গত ৩১ মে সংসদে গ্রীষ্মকালীন অধিবেশন শেষ হওয়ার আগে একটি ভাষণ দেন। এটি ডেনমার্কের সংসদের একটি ঐতিহ্য। তো এই খবরে চোখ আটকে গেল কেন?',
                'description 2' => 'সকালবেলা পত্রিকা হাতে নিতেই একটা খবরে চোখ আটকে গেল। ডেনমার্কের প্রধানমন্ত্রী মিতে ফ্রেডিরিকসেন গত ৩১ মে সংসদে গ্রীষ্মকালীন অধিবেশন শেষ হওয়ার আগে একটি ভাষণ দেন। এটি ডেনমার্কের সংসদের একটি ঐতিহ্য। তো এই খবরে চোখ আটকে গেল কেন? এই ভাষণের একটি অংশ নাকি প্রধানমন্ত্রী অথবা অন্য কোনো মানুষের মস্তিষ্কপ্রসূত নয়! তাহলে কার? অবিশ্বাস্য হলেও এটাই সত্য যে ভাষণের ওই অংশটুকু লিখেছে চ্যাটজিপিটি! এ প্রসঙ্গে প্রধানমন্ত্রী মিতে ফ্রেডিরিকসেন বলেন, এটা (চ্যাটজিপিটি) যা করতে পারে, সেটা একই সঙ্গে আকর্ষণীয় ও ভয়ংকর। কী এই চ্যাটজিপিটি, যা নিয়ে চারদিকে চলছে এত আলোচনা, সমালোচনা, গবেষণা ও পর্যালোচনা? এটা এখন টক অব দ্য ওয়ার্ল্ড। চ্যাটজিপিটি (চ্যাট জেনারেটিভ প্রি-ট্রেইনড ট্রান্সফরমার) মূলত একটি চ্যাটবট বা অন্য কথায় এটি কথোপকথন বা আলাপচারিতার একটি অ্যাপস। কৃত্রিম বুদ্ধিমত্তা (Artificial Intelligence) প্রযুক্তি ব্যবহার করে অ্যাপ্লিকেশনটি তৈরি করা হয়েছে। যুক্তরাষ্ট্রভিত্তিক প্রতিষ্ঠান ওপেন এআই এটির উদ্ভাবক। এ অ্যাপসকে যেকোনো বিষয়ে প্রশ্ন করলে তৎক্ষণাৎ তার উত্তর দিতে পারে। শুধু তা-ই নয়, কবিতা, গল্প, নিবন্ধও লিখতে পারে! এখানেই তার ক্যারিশমা শেষ নয়, তাকে কোনো কম্পিউটার প্রোগ্রাম লিখে দিতে বললে, সে সেটাও করতে পারে। এহেন কোনো বিষয় নেই, যে বিষয়ে তার পাণ্ডিত্য নেই। সোজা বাংলায় যাকে বলে সবজান্তা শমসের! সম্প্রতি যুক্তরাষ্ট্রের একটি আইন বিদ্যালয়ের পরীক্ষায় পাস করেছে চ্যাটজিপিটি। এ প্রসঙ্গে মিনেসোটা বিশ্ববিদ্যালয়ের ল স্কুলের অধ্যাপক জোনাথন চই ‘চ্যাটজিপিটি গোজ টু ল স্কুল’ নামের একটি শ্বেতপত্র প্রকাশ করেছেন, তাতে বলা হয়েছে, পরীক্ষায় চ্যাটজিপিটি সি প্লাস স্কোর করেছে, যা পাসিং গ্রেডের চেয়ে বেশি। ওই পরীক্ষায় ৯৫টি বহুনির্বাচনী প্রশ্ন ও ১২টি প্রবন্ধের প্রশ্ন ছিল।',
                'image' => 'assets/img/contents/4.jpg',
            ],
            4 => [
                'id' => 5,
                'menu_id' => 1,
                'title' => 'বিএসএমএমইউতে নার্সিংয়ের ভর্তিতে আবেদন শেষ আজই, প্রার্থীকে হতে হবে অবিবাহিত',
                'description 1' => 'বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়ের (বিএসএমএমইউ) বিএসসি ইন নার্সিংয়ে ২০২২-২০২৩ সেশনের ভর্তিতে আবেদন শেষ আজ শনিবার ৩ জুন। ',
                'description 2' => 'গতকাল ২৭ মে বিএসএমএমইউয়ের এক বিজ্ঞপ্তিতে জানানো হয়েছে, এ বিশ্ববিদ্যালয়ে নার্সিং অনুষদের অর্ন্তভুক্ত বিএসসি ইন নার্সিং ২০২২-২৩ সেশনের ভর্তিতে প্রকাশিত বিজ্ঞপ্তি মোতাবেক আগ্রহী প্রার্থীদের জন্য ব্যাংকে টাকা জমা দেওয়ার শেষ দিন ছিল ১ জুন। আবেদন করার শেষ দিন ৩ জুন। আগামী ১০ জুন শনিবার লিখিত পরীক্ষা অনুষ্ঠিত হবে। ৬ জুন থেকে ১০ জুন দুপুর ১২টা পর্যন্ত প্রবেশপত্র প্রিন্ট করতে পারবেন শিক্ষার্থীরা। বিজ্ঞপ্তিতে প্রকাশিত অন্যান্য সকল শর্ত আগের মতো বহাল থাকবে। আবেদনের যোগ্যতা
                *এসএসসি/সমমান পরীক্ষায় বিজ্ঞান বিভাগ থেকে ২০১৯ ও ২০২০ সালে ও এইচএসসি/সমমান পরীক্ষায় বিজ্ঞান বিভাগ থেকে ২০২১ ও ২০২২ সালে অনুষ্ঠিত পরীক্ষার উত্তীর্ণরা আবেদন করতে পারবেন।
                *এসএসসি/সমমান এবং এইচএসসি/সমমানের পরীক্ষাগুলোর জিপিএর যোগফল ন্যূনতম ৭ থাকতে হবে। তবে কোনো পরীক্ষায় জিপিএ–৩–এর কম হলে চলবে না। উভয় পরীক্ষায় জীববিজ্ঞানে জিপিএ–৩ থাকতে হবে।
                *প্রার্থীকে অবশ্যই অবিবাহিত হতে হবে। কোর্স চলাকালে বিবাহবন্ধনে আবদ্ধ হতে পারবেন না। কোর্সের যেকোনো পর্যায়ে বিবাহিত প্রমাণিত হলে ভর্তি বাতিল করা হবে।
                বয়সসীমা
                চলতি বছরের ৩০ মে আবেদনকারীর বয়স অনূর্ধ্ব–২২ বছর হতে হবে।
                আবেদন যেভাবে 
                আগ্রহী প্রার্থীদের ওয়েবসাইটের মাধ্যমে অনলাইনে (http://bsmmu.ac.bd/public/uploads/files/a6b6bf8570f20da2fa6ad23f41316584.pdf) আবেদন করতে হবে।
                *নতুন বিজ্ঞপ্তি দেখুন (http://bsmmu.ac.bd/public/uploads/files/378fe32f2823acb021690c85394586e8.pdf) এখানে',
                'image' => 'assets/img/contents/5.jpg',
            ],
            5 => [
                'id' => 6,
                'menu_id' => 3,
                'title' => 'মাদক ছেড়েছেন দাবি, স্বাভাবিক জীবনে ফিরতে এসপির কাছে আবেদন ',
                'description 1' => 'মাদককে না বলুন',
                'description 2' => 'নারায়ণগঞ্জের ফতুল্লা এলাকার বাসিন্দা মো. শাহিন সরকার (৩৮)। মাদক সেবনের পাশাপাশি এই ব্যবসায় জড়িয়ে একাধিক মামলার আসামি হয়েছেন তিনি। তবে এখন শাহিনের দাবি, তিনি এসব ছেড়ে দিয়েছেন। তিনি এখন স্বাভাবিক জীবন যাপন করতে চান। এ জন্য তিনি সম্প্রতি নারায়ণগঞ্জের পুলিশ সুপারের (এসপি) কাছে আবেদন করেন। শাহিনের আবেদন পেয়ে বিষয়টি খতিয়ে দেখে জেলা পুলিশ। ইতিবাচক তথ্য পেয়ে তাঁকে স্বাভাবিক জীবনযাপনে সহায়তায় থানা-পুলিশকে নির্দেশনা দেন এসপি। এ প্রসঙ্গে নারায়ণগঞ্জের এসপি গোলাম মোস্তফা রাসেল গত বুধবার প্রথম আলোকে বলেন, ‘আমরা শাহিনের স্বাভাবিক জীবনযাপনে সহায়তা করব। পাশাপাশি খেয়াল রাখব, তিনি যেন আবার মাদকের সঙ্গে জড়িয়ে না পড়েন।’ শাহিনের পৈতৃক বাড়ি কুমিল্লায়। তবে বাবার কর্মসূত্রে তাঁর (শাহিন) জন্ম ও বেড়ে ওঠা নারায়ণগঞ্জে। গত সপ্তাহে শাহিনের সঙ্গে কথা হয় প্রথম আলোর। তিনি বলেন, তাঁরা ১০ ভাইবোন। তাঁর বাবা শামছুল হক সরকার নারায়ণগঞ্জের একটি টেক্সটাইল কারখানায় ছোটখাটো চাকরি করতেন। এই চাকরির জন্যই তাঁর বাবা ফতুল্লায় বাসা নিয়েছিলেন। ফতুল্লাতেই তাঁর (শাহিন) জন্ম হয়। তাঁর বাবা বেঁচে নেই। অভাবের কারণে শাহিনের তেমন পড়াশোনা করা হয়নি। ছোটবেলাতেই সংসারের হাল ধরতে হয় তাঁকে। গাড়িচালকের সহযোগী (হেলপার) হিসেবে কাজ শুরু করেন। পরে প্রশিক্ষণ নিয়ে গাড়ি চালানো শুরু করেন। শাহিনের ভাষ্য, সে সময় অসৎসঙ্গে তিনি মাদকাসক্ত হয়ে পড়েন। গাড়ি চালানো ছেড়ে দেন। নেশার টাকা জোগাড় করতে গিয়ে মাদক ব্যবসায় জড়িয়ে পড়েন। তাঁর বিরুদ্ধে নারায়ণগঞ্জের বিভিন্ন থানায় বেশ কয়েকটি মামলা হয়। এসব মামলায় গ্রেপ্তার হয়ে একাধিকবার জেলও খাটেন তিনি।',
                'image' => 'assets/img/contents/6.jpg',
            ],
            6 => [
                'id' => 7,
                'menu_id' => 3,
                'title' => 'মাদক ছেড়েছেন দাবি, স্বাভাবিক জীবনে ফিরতে এসপির কাছে আবেদন ',
                'description 1' => 'মাদককে না বলুন',
                'description 2' => 'নারায়ণগঞ্জের ফতুল্লা এলাকার বাসিন্দা মো. শাহিন সরকার (৩৮)। মাদক সেবনের পাশাপাশি এই ব্যবসায় জড়িয়ে একাধিক মামলার আসামি হয়েছেন তিনি। তবে এখন শাহিনের দাবি, তিনি এসব ছেড়ে দিয়েছেন। তিনি এখন স্বাভাবিক জীবন যাপন করতে চান। এ জন্য তিনি সম্প্রতি নারায়ণগঞ্জের পুলিশ সুপারের (এসপি) কাছে আবেদন করেন। শাহিনের আবেদন পেয়ে বিষয়টি খতিয়ে দেখে জেলা পুলিশ। ইতিবাচক তথ্য পেয়ে তাঁকে স্বাভাবিক জীবনযাপনে সহায়তায় থানা-পুলিশকে নির্দেশনা দেন এসপি। এ প্রসঙ্গে নারায়ণগঞ্জের এসপি গোলাম মোস্তফা রাসেল গত বুধবার প্রথম আলোকে বলেন, ‘আমরা শাহিনের স্বাভাবিক জীবনযাপনে সহায়তা করব। পাশাপাশি খেয়াল রাখব, তিনি যেন আবার মাদকের সঙ্গে জড়িয়ে না পড়েন।’ শাহিনের পৈতৃক বাড়ি কুমিল্লায়। তবে বাবার কর্মসূত্রে তাঁর (শাহিন) জন্ম ও বেড়ে ওঠা নারায়ণগঞ্জে। গত সপ্তাহে শাহিনের সঙ্গে কথা হয় প্রথম আলোর। তিনি বলেন, তাঁরা ১০ ভাইবোন। তাঁর বাবা শামছুল হক সরকার নারায়ণগঞ্জের একটি টেক্সটাইল কারখানায় ছোটখাটো চাকরি করতেন। এই চাকরির জন্যই তাঁর বাবা ফতুল্লায় বাসা নিয়েছিলেন। ফতুল্লাতেই তাঁর (শাহিন) জন্ম হয়। তাঁর বাবা বেঁচে নেই। অভাবের কারণে শাহিনের তেমন পড়াশোনা করা হয়নি। ছোটবেলাতেই সংসারের হাল ধরতে হয় তাঁকে। গাড়িচালকের সহযোগী (হেলপার) হিসেবে কাজ শুরু করেন। পরে প্রশিক্ষণ নিয়ে গাড়ি চালানো শুরু করেন। শাহিনের ভাষ্য, সে সময় অসৎসঙ্গে তিনি মাদকাসক্ত হয়ে পড়েন। গাড়ি চালানো ছেড়ে দেন। নেশার টাকা জোগাড় করতে গিয়ে মাদক ব্যবসায় জড়িয়ে পড়েন। তাঁর বিরুদ্ধে নারায়ণগঞ্জের বিভিন্ন থানায় বেশ কয়েকটি মামলা হয়। এসব মামলায় গ্রেপ্তার হয়ে একাধিকবার জেলও খাটেন তিনি।',
                'image' => 'assets/img/contents/6.jpg',
            ],
            7 => [
                'id' => 8,
                'menu_id' => 3,
                'title' => 'মাদক ছেড়েছেন দাবি, স্বাভাবিক জীবনে ফিরতে এসপির কাছে আবেদন ',
                'description 1' => 'মাদককে না বলুন',
                'description 2' => 'নারায়ণগঞ্জের ফতুল্লা এলাকার বাসিন্দা মো. শাহিন সরকার (৩৮)। মাদক সেবনের পাশাপাশি এই ব্যবসায় জড়িয়ে একাধিক মামলার আসামি হয়েছেন তিনি। তবে এখন শাহিনের দাবি, তিনি এসব ছেড়ে দিয়েছেন। তিনি এখন স্বাভাবিক জীবন যাপন করতে চান। এ জন্য তিনি সম্প্রতি নারায়ণগঞ্জের পুলিশ সুপারের (এসপি) কাছে আবেদন করেন। শাহিনের আবেদন পেয়ে বিষয়টি খতিয়ে দেখে জেলা পুলিশ। ইতিবাচক তথ্য পেয়ে তাঁকে স্বাভাবিক জীবনযাপনে সহায়তায় থানা-পুলিশকে নির্দেশনা দেন এসপি। এ প্রসঙ্গে নারায়ণগঞ্জের এসপি গোলাম মোস্তফা রাসেল গত বুধবার প্রথম আলোকে বলেন, ‘আমরা শাহিনের স্বাভাবিক জীবনযাপনে সহায়তা করব। পাশাপাশি খেয়াল রাখব, তিনি যেন আবার মাদকের সঙ্গে জড়িয়ে না পড়েন।’ শাহিনের পৈতৃক বাড়ি কুমিল্লায়। তবে বাবার কর্মসূত্রে তাঁর (শাহিন) জন্ম ও বেড়ে ওঠা নারায়ণগঞ্জে। গত সপ্তাহে শাহিনের সঙ্গে কথা হয় প্রথম আলোর। তিনি বলেন, তাঁরা ১০ ভাইবোন। তাঁর বাবা শামছুল হক সরকার নারায়ণগঞ্জের একটি টেক্সটাইল কারখানায় ছোটখাটো চাকরি করতেন। এই চাকরির জন্যই তাঁর বাবা ফতুল্লায় বাসা নিয়েছিলেন। ফতুল্লাতেই তাঁর (শাহিন) জন্ম হয়। তাঁর বাবা বেঁচে নেই। অভাবের কারণে শাহিনের তেমন পড়াশোনা করা হয়নি। ছোটবেলাতেই সংসারের হাল ধরতে হয় তাঁকে। গাড়িচালকের সহযোগী (হেলপার) হিসেবে কাজ শুরু করেন। পরে প্রশিক্ষণ নিয়ে গাড়ি চালানো শুরু করেন। শাহিনের ভাষ্য, সে সময় অসৎসঙ্গে তিনি মাদকাসক্ত হয়ে পড়েন। গাড়ি চালানো ছেড়ে দেন। নেশার টাকা জোগাড় করতে গিয়ে মাদক ব্যবসায় জড়িয়ে পড়েন। তাঁর বিরুদ্ধে নারায়ণগঞ্জের বিভিন্ন থানায় বেশ কয়েকটি মামলা হয়। এসব মামলায় গ্রেপ্তার হয়ে একাধিকবার জেলও খাটেন তিনি।',
                'image' => 'assets/img/contents/6.jpg',
            ],
            8 => [
                'id' => 9,
                'menu_id' => 2,
                'title' => 'দুর্ঘটনার পর দৌড়ঝাঁপ, কিছুদিন পর ‘চুপচাপ’ ',
                'description 1' => 'ঝুঁকিপূর্ণ বহুতল ভবনগুলোর বিষয়ে সিদ্ধান্ত নিতে চার বছর আগে বিশেষজ্ঞ কমিটি করেছিল রাজউক। কিন্তু কমিটির সুপারিশ আমলে নেওয়া হয়নি।',
                'description 2' => 'যখনই রাজধানীতে কোনো ভবনে অগ্নিকাণ্ড বা বড় ধরনের কোনো দুর্ঘটনা ঘটে, তখনই রাজধানী উন্নয়ন কর্তৃপক্ষ তৎপর হয়ে ওঠে। কিন্তু কিছুদিন যেতে না যেতেই তাদের উদ্যোগও ধীরে ধীরে থেমে যায়। ২০১৯ সালের মার্চ মাসে বনানীর এফআর টাওয়ারে অগ্নিকাণ্ডের পর রাজউকের আওতাধীন এলাকার বহুতল (১০ তলার ওপর) সব ভবনের অগ্নিনির্বাপণ ব্যবস্থার তথ্য সংগ্রহের কাজ শুরু করে রাজউক। চার বছর পর এসে দেখা যাচ্ছে, তথ্য পেলেও ঝুঁকিপূর্ণ ভবনগুলো নিরাপদ করার ব্যবস্থা নেওয়া হয়নি। সর্বশেষ গত ৭ মার্চ পুরান ঢাকার সিদ্দিক বাজারে একটি ভবনের বেজমেন্টে (ভূগর্ভস্থ তলা) অগ্নিকাণ্ডের পর নতুন আরেকটি উদ্যোগ নেয় রাজধানী উন্নয়ন কর্তৃপক্ষ (রাজউক)। মূলত বেজমেন্টের ঝুঁকিপূর্ণ ব্যবহার হচ্ছে কি না, সেই খোঁজ নেওয়া শুরু করে রাজউক। সিদ্দিক বাজারে বেজমেন্টে বিস্ফোরণ থেকেই ভবনটিতে অগ্নিকাণ্ডের ঘটনা ঘটে। এতে সাততলা ভবনটির বেজমেন্ট, প্রথম ও দ্বিতীয় তলা ধ্বংসস্তূপে পরিণত হয়, নিহত হন ২৬ জন।',
                'image' => 'assets/img/contents/7.jpg',
            ],
            9 => [
                'menu_id' => 2,
                'title' => 'দুর্ঘটনার পর দৌড়ঝাঁপ, কিছুদিন পর ‘চুপচাপ’ ',
                'description 1' => 'ঝুঁকিপূর্ণ বহুতল ভবনগুলোর বিষয়ে সিদ্ধান্ত নিতে চার বছর আগে বিশেষজ্ঞ কমিটি করেছিল রাজউক। কিন্তু কমিটির সুপারিশ আমলে নেওয়া হয়নি।',
                'description 2' => 'যখনই রাজধানীতে কোনো ভবনে অগ্নিকাণ্ড বা বড় ধরনের কোনো দুর্ঘটনা ঘটে, তখনই রাজধানী উন্নয়ন কর্তৃপক্ষ তৎপর হয়ে ওঠে। কিন্তু কিছুদিন যেতে না যেতেই তাদের উদ্যোগও ধীরে ধীরে থেমে যায়। ২০১৯ সালের মার্চ মাসে বনানীর এফআর টাওয়ারে অগ্নিকাণ্ডের পর রাজউকের আওতাধীন এলাকার বহুতল (১০ তলার ওপর) সব ভবনের অগ্নিনির্বাপণ ব্যবস্থার তথ্য সংগ্রহের কাজ শুরু করে রাজউক। চার বছর পর এসে দেখা যাচ্ছে, তথ্য পেলেও ঝুঁকিপূর্ণ ভবনগুলো নিরাপদ করার ব্যবস্থা নেওয়া হয়নি। সর্বশেষ গত ৭ মার্চ পুরান ঢাকার সিদ্দিক বাজারে একটি ভবনের বেজমেন্টে (ভূগর্ভস্থ তলা) অগ্নিকাণ্ডের পর নতুন আরেকটি উদ্যোগ নেয় রাজধানী উন্নয়ন কর্তৃপক্ষ (রাজউক)। মূলত বেজমেন্টের ঝুঁকিপূর্ণ ব্যবহার হচ্ছে কি না, সেই খোঁজ নেওয়া শুরু করে রাজউক। সিদ্দিক বাজারে বেজমেন্টে বিস্ফোরণ থেকেই ভবনটিতে অগ্নিকাণ্ডের ঘটনা ঘটে। এতে সাততলা ভবনটির বেজমেন্ট, প্রথম ও দ্বিতীয় তলা ধ্বংসস্তূপে পরিণত হয়, নিহত হন ২৬ জন।',
                'image' => 'assets/img/contents/7.jpg',
            ],
            10 => [
                'id' => 11,
                'menu_id' => 2,
                'title' => 'দুর্ঘটনার পর দৌড়ঝাঁপ, কিছুদিন পর ‘চুপচাপ’ ',
                'description 1' => 'ঝুঁকিপূর্ণ বহুতল ভবনগুলোর বিষয়ে সিদ্ধান্ত নিতে চার বছর আগে বিশেষজ্ঞ কমিটি করেছিল রাজউক। কিন্তু কমিটির সুপারিশ আমলে নেওয়া হয়নি।',
                'description 2' => 'যখনই রাজধানীতে কোনো ভবনে অগ্নিকাণ্ড বা বড় ধরনের কোনো দুর্ঘটনা ঘটে, তখনই রাজধানী উন্নয়ন কর্তৃপক্ষ তৎপর হয়ে ওঠে। কিন্তু কিছুদিন যেতে না যেতেই তাদের উদ্যোগও ধীরে ধীরে থেমে যায়। ২০১৯ সালের মার্চ মাসে বনানীর এফআর টাওয়ারে অগ্নিকাণ্ডের পর রাজউকের আওতাধীন এলাকার বহুতল (১০ তলার ওপর) সব ভবনের অগ্নিনির্বাপণ ব্যবস্থার তথ্য সংগ্রহের কাজ শুরু করে রাজউক। চার বছর পর এসে দেখা যাচ্ছে, তথ্য পেলেও ঝুঁকিপূর্ণ ভবনগুলো নিরাপদ করার ব্যবস্থা নেওয়া হয়নি। সর্বশেষ গত ৭ মার্চ পুরান ঢাকার সিদ্দিক বাজারে একটি ভবনের বেজমেন্টে (ভূগর্ভস্থ তলা) অগ্নিকাণ্ডের পর নতুন আরেকটি উদ্যোগ নেয় রাজধানী উন্নয়ন কর্তৃপক্ষ (রাজউক)। মূলত বেজমেন্টের ঝুঁকিপূর্ণ ব্যবহার হচ্ছে কি না, সেই খোঁজ নেওয়া শুরু করে রাজউক। সিদ্দিক বাজারে বেজমেন্টে বিস্ফোরণ থেকেই ভবনটিতে অগ্নিকাণ্ডের ঘটনা ঘটে। এতে সাততলা ভবনটির বেজমেন্ট, প্রথম ও দ্বিতীয় তলা ধ্বংসস্তূপে পরিণত হয়, নিহত হন ২৬ জন।',
                'image' => 'assets/img/contents/7.jpg',
            ],
        ];
    }

    public function getAllContents()
    {
        return $this->contents;
    }

    public function getMenuContent($id)
    {
        foreach ($this->contents as $content)
        {
            if ($content['menu_id'] == $id)
            {
                array_push($this->data, $content);
            }
        }

        return $this->data;
    }

    public function getContentById($id)
    {
        foreach ($this->contents as $content)
        {
            if ($content['id'] == $id)
            {
                return $content;
            }
        }
    }

}